class iphone15promax:
    attackBtn = [2388,1087]                                      # 攻击按钮
    attackPos = [                                           # 点击攻击的卡面，第一行宝具卡，第二行普通指令卡
        [[1017, 296], [1435, 296], [1789, 296]],
        [[510, 893], [941, 852], [1414, 858], [1873, 877], [2350, 887]],
    ]
    skillChoose = [                                         # 技能选择，一行一个从者
        [[229, 995], [383, 995], [542, 995]],
        [[790, 995], [955, 995], [1111, 995]],
        [[1360, 995], [1527, 995], [1684, 995]],
    ]
    skillConfirmBtn = [1805, 755]                                # 技能确认
    skillSvtPos = [[852, 723], [1411, 707], [1991,685]]                  # 技能给单体时选人
    masterSkill = [2523, 580]                                    # Master的技能
    masterSkillPos = [[2010, 553], [2175, 553], [2331, 553]]               # Master的技能位
    orderPos = [[510, 615], [863, 615], [1236, 615], [1578, 615], [1948, 615], [2280, 615]]  # 换人服的从者位置
    orderPosConfirm = [1406, 1109]                                # 确认换人
    # 战斗结束
    continueBattleBtn = [1789, 1006]  # 连续出击
    nextBtn = [2242, 1144]            # 下一步
    confirmApple = [1713, 1012]       # 补苹果
    refreshList = [1824, 251]        # 好友列表刷新
    refreshBtn = [1775, 1004]         # 好友列表刷新确认
    closeFrd = [847, 1109]           # 关闭是否发送好友申请
    # 无限池
    unlimitedExec = [0, 0]      # 执行
    unlimitedClose = [0, 0]     # 关闭
    unlimitedReset = [0, 0]     # 重置礼物
